app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "login", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Angelina"], ["email", "sycheva_95@mail.ru"], ["login", "AngelinaS"], ["created_at", "2015-03-05 09:14:52.685174"], ["updated_at", "2015-03-05 09:14:52.685174"]]
---
  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save

UPDATE "users" SET "name" = ?, "email" = ?, "login" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Angelina"], ["email", "sycheva_95@mail.ru"], ["login", "AngelinaS"], ["updated_at", "2015-03-05 09:12:47.324902"], ["id", 35]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)